/***********************************************************\
 * © 1993 Adobe Systems Incorporated. All rights reserved. *
 *                                                         *
 *   Core Flash Player localizable strings                 *
\***********************************************************/

/////////////////////////////////////////////////////////////
// BLOCK 1: User Interface strings                         //
/////////////////////////////////////////////////////////////

// Shared strings
"GenericDialog_Header"						= "Adobe Flash Player %@";

// Local security dialog
"LocalSecurity_Title"						= "Zabezpečení přehrávače Adobe Flash Player";
"LocalSecurity_Line1"						= "Přehrávač Adobe® Flash® Player zastavil potenciálně nebezpečnou operaci. Následující lokální aplikace v tomto počítači nebo v síti:";
"LocalSecurity_Line2"						= "se pokouší o komunikaci s umístěním s podporou internetu:";
"LocalSecurity_Line3"						= "Pokud této aplikaci chcete umožnit komunikaci s internetem, klepněte na tlačítko Nastavení.\nPo změně nastavení musíte aplikaci restartovat.";

"LocalSecurity_SettingsBtn"					= "Nastavení…";
"LocalSecurity_OKBtn"						= "OK";

// Flash Exception dialog
"ActionScriptErrorLabel"					= "Došlo k chybě skriptu ActionScript:";
"ExceptionDialog_DismissAllButton"			= "Zrušit vše";
"ExceptionDialog_ContinueButton"			= "Pokračovat";

// Script taking too long dialog
"StuckScript_Message"						= "Skript v tomto filmu způsobuje zpomalení přehrávače Adobe® Flash® Player. Pokud bude jeho činnost pokračovat, počítač pravděpodobně přestane odpovídat.\n\nChcete skript přerušit?";
"StuckScript_YesBtn"						= "Ano";
"StuckScript_NoBtn"							= "Ne";

// Debug or profile connection failed dialog
"DebugFailed_Header"						= "Adobe® Flash® Player";
"DebugFailed_Message"						= "Spojení s nástrojem Debugger nebo Profiler nelze aplikací Adobe Flash Player navázat.";

// Debugger connection dialog
"ShowDialogAtLaunchText"					= "Zobrazit tento dialog při spuštění";
"ConnectToDebuggerText"						= "Připojit k ladicímu programu";
"DebuggerLocationText"						= "Je spuštěn ladicí program nebo hostitelská aplikace:";
"LocationLocalText"							= "V tomto počítači (localhost)";
"LocationRemoteText"						= "Na adrese IP:";
"ContinueButtonTitle"						= "Pokračovat";

// Can't find preference pane alert
"CantFindPrefPane_Title"					= "Unable to Load Flash Player Preferences Pane";
"CantFindPrefPane_Message"					= "To access your global settings, re-install Adobe Flash Player. It can be downloaded from http://www.adobe.com/go/getflashplayer";

// ----------------------------------------------------------
"IDS_FILE_CHOOSER_TITLE"					= "Zvolit soubory";
"IDS_DIR_CHOOSER_TITLE"						= "Zvolit složku";
"IDS_CHOOSER_SELECT_BUTTON"					= "Vybrat";

// ----------------------------------------------------------
"IDS_FILE_UPLOAD_CHOOSER"					= "Vyberte soubor, který chcete odeslat prostřednictvím ";
"IDS_FILE_UPLOAD_CHOOSER_MULTI_SELECT"		= "Vyberte soubory, které chcete odeslat prostřednictvím ";
"IDS_FILE_DOWNLOAD_SAVE"					= "Vyberte umístění pro stahování prostřednictvím ";
"IDS_DOWNLOAD_FILE_SAVE_CLASSIC_PLUGIN"		= "Vyberte umístění pro stahování";
"IDS_FILE_LOCAL_SAVE"						= "Vybrat soubor k uložení";

// ----------------------------------------------------------

/////////////////////////////////////////////////////////////
// BLOCK 2: Error strings                                  //
/////////////////////////////////////////////////////////////

"IDS_CONSOLE_CASE"							= "-- Příčinou je pravděpodobně nesprávný zápis malých a velkých písmen.";
"IDS_CONSOLE_SANDBOX"						= "*** Porušení rozsahu zabezpečení ***";
"IDS_CONSOLE_NOT_PERMITTED"					= "Připojení k %s bylo přerušeno – není povoleno z %s";
"IDS_CONSOLE_TITLE"							= "Konzola ladění přehrávače Flash Player";
"IDS_CONSOLE_FSCOMMAND_HALTED"				= "Příkaz FSCommand byl zastaven (parametr AllowScriptAccess je \'%s\'): %s";
"IDS_CONSOLE_URL_HALTED"					= "Adresa URL skriptu byla zastavena (parametr AllowScriptAccess je \'%s\'): %s";
"IDS_CONSOLE_SECURITY_CONTEXT"				= "Doména zabezpečení \'%s\' se pokusila o přístup k nekompatibilnímu kontextu \'%s\'";
"IDS_CONSOLE_SECURITY_NULL"					= "Doména zabezpečení \'%s\' se pokusila o přístup k nulovému kontextu";
"IDS_CONSOLE_SECURITY_PLAYER"				= "Doména zabezpečení \'%s\' se pokusila o přístup ke kontextu uživatelského rozhraní přehrávače";
"IDS_CONSOLE_WARN_NO_PROP"					= "Upozornění: \'%s\' nemá žádnou vlastnost \'%s\'";
"IDS_CONSOLE_WARN_NOT_A_FUNC"				= "Upozornění: %s nepředstavuje funkci";
"IDS_CONSOLE_WARN_NOT_DEFINED"				= "Upozornění: %s není definováno";
"IDS_CONSOLE_WARN_400"						= "Upozornění: 400 – Chybný požadavek: %s";
"IDS_CONSOLE_WARN_401"						= "Upozornění: 401 – Neoprávněný: %s";
"IDS_CONSOLE_WARN_402"						= "Upozornění: 402 – Je vyžadována platba: %s";
"IDS_CONSOLE_WARN_403"						= "Upozornění: 403 - Zakázaný: %s";
"IDS_CONSOLE_WARN_404"						= "Upozornění: 404 – Nenalezeno: %s";
"IDS_CONSOLE_WARN_405"						= "Upozornění: 405 – Metoda není povolena, neplatný typ MIME: %s";
"IDS_CONSOLE_WARN_406"						= "Upozornění: 406 – Nepřípustné: %s";
"IDS_CONSOLE_WARN_500"						= "Upozornění: 500 – Chyba serveru: %s";
"IDS_CONSOLE_WARN_501"						= "Upozornění: 501 – Neimplementováno: %s";
"IDS_CONSOLE_WARN_502"						= "Upozornění: 502 – Nesprávná brána: %s";
"IDS_CONSOLE_WARN_503"						= "Upozornění: 503 – Nedostatek zdrojů: %s";
"IDS_CONSOLE_WARN_504"						= "Upozornění: 504 – Doba platnosti brány vypršela: %s";
"IDS_CONSOLE_WARN_505"						= "Upozornění: 505 – Verze HTTP není podporována: %s";
"IDS_CONSOLE_WARN_NO_CONNECT"				= "Upozornění: Nelze navázat spojení, %s";
"IDS_CONSOLE_WARN_FAIL_ALLOCATE_URL"		= "Upozornění: Přidělení cesty URL se nezdařilo";
"IDS_CONSOLE_WARN_CORRUPT_DATA"				= "Upozornění: Analýza porušených dat se nezdařila.";
"IDS_CONSOLE_WARN_FAIL_PLACE"				= "Upozornění: Umístění objektu do hloubky %d se nezdařilo.";
"IDS_CONSOLE_WARN_FAIL_PLACE_MISSING_CHAR" 	= "Upozornění: Umístění objektu se nezdařilo: chybí znak";
"IDS_CONSOLE_WARN_FTP_FILE"					= "Upozornění: Chyba otevírání souboru protokolem FTP, %s";
"IDS_CONSOLE_WARN_HTTP_REQUEST"				= "Upozornění: Chyba otevírání požadavku HTTP, %s";
"IDS_CONSOLE_WARN_HTTP_QUERY"				= "Upozornění: Chyba informací dotazu HTTP, %s";
"IDS_CONSOLE_WARN_HTTP_SEND"				= "Upozornění: Chyba odesílání požadavku HTTP, %d: %s";
"IDS_CONSOLE_WARN_NET_CONNECT"				= "Upozornění: Chyba připojení k internetu, %s";
"IDS_CONSOLE_WARN_NET_OPEN"					= "Upozornění: Chyba připojení k internetu";
"IDS_CONSOLE_WARN_UNKNOWN_DOWNLOAD_TYPE"	= "Upozornění: Neznámý typ stahování přehrávače, %s";
"IDS_CONSOLE_WARN_BAD_PORT"					= "Upozornění: Port %d je mimo povolený rozsah.";
"IDS_CONSOLE_WARN_WARNING_LIMIT"			= "Upozornění: Dosažen limit upozornění %d";
"IDS_CONSOLE_WARN_UNDECLARED_PROP"			= "Upozornění: Odkaz na nedeklarovanou vlastnost, \'%s\'";
"IDS_CONSOLE_WARN_UNDECLARED_VAR"			= "Upozornění: Odkaz na nedeklarovanou proměnnou, \'%s\'";
"IDS_CONSOLE_WARN_SOCKET_ERROR"				= "Upozornění: Chyba socketu, %s";
"IDS_CONSOLE_WARN_STACK"					= "Upozornění: Přetečení zásobníku";
"IDS_CONSOLE_WARN_HOST"						= "Upozornění: Nelze určit hostitele: %s";
"IDS_CONSOLE_WARN_GENERIC_HOST"				= "Upozornění: Nelze určit hostitele";
"IDS_CONSOLE_WARN_EXCEPTION"				= "Upozornění: Nezachycená výjimka, %s";
"IDS_CONSOLE_WARN_HTTP_STATUS"				= "Upozornění: Neznámý stav HTTP %d: %s";
"IDS_CONSOLE_WARN_NO_URL"					= "Upozornění: Není cesta URL";
"IDS_CONSOLE_SECURITY_DIALOG"				= "Došlo ke shodě se starší doménou – %s se pokouší o přístup k %s";
"IDS_CONSOLE_LOCAL_OUTBOUND"				= "-- Nedůvěryhodné místní SWF nemusí mít přístup k internetu.";
"IDS_CONSOLE_LOCAL_INBOUND"					= "-- Vzdálené SWF nemusí mít přístup k místním souborům.";
"IDS_CONSOLE_WARN_AVM1_LOADED_AVM2"			= "Upozornění: Soubor SWF skriptu ActionScript 1.0/2.0 načetl SWF skriptu ActionScript 3.0; kód v SWF skriptu ActionScript 3.0 nebude spuštěn.";
"IDS_CONSOLE_WINDOW_HALTED"					= "Adresa URL pro okno \'%s\' byla zastavena (parametr AllowScriptAccess je \'%s\'): %s";
"IDS_CONSOLE_ALLOW_NETWORK"					= "-- Důvodem je hodnota parametru \'allowNetworking\'.";
"IDS_CONSOLE_NO_POLICY_FILE"				= "Soubor zásad z %s se nepodařilo načíst";
"IDS_CONSOLE_BAD_POLICY_FILE"				= "[přísné] Ignorován soubor zásad v %s z důvodu nesprávné syntaxe.  Informace o vyřešení tohoto problému naleznete na adrese http://www.adobe.com/go/strict_policy_files_cz.";
"IDS_CONSOLE_PREFIX_OK"						= "OK: ";
"IDS_CONSOLE_PREFIX_WARNING"				= "Upozornění: ";
"IDS_CONSOLE_PREFIX_ERROR"					= "Chyba: ";
"IDS_CONSOLE_GOOD_POLICY_FILE"				= "Soubor zásad byl přijat: %s";
"IDS_CONSOLE_BAD_POLICY_FILE_TYPE"			= "[přísné] Ignorován soubor zásad v %s z důvodu nesprávného typu obsahu \'%s\'.  Informace o vyřešení tohoto problému naleznete na adrese http://www.adobe.com/go/strict_policy_files_cz.";
"IDS_CONSOLE_NO_POLICY_FILE_TYPE"			= "[strict] Ignorován soubor zásad v %s z důvodu chybějícího typu obsahu \'%s\'.  Informace o vyřešení tohoto problému naleznete na adrese http://www.adobe.com/go/strict_policy_files_cz.";
"IDS_CONSOLE_POLICY_FILE_NO_HEADERS"		= "Hlavičky odpovědi HTTP nejsou na této platformě dostupné.  Přísná pravidla souboru zásad nelze uplatnit.";
"IDS_CONSOLE_POLICY_FILE_REDIRECT"			= "[přísné] Byl vyžádán soubor zásad z %s přesměrovaný do %s. Při určování rozsahu bude použitá konečná adresa URL.  Pokud dojde k problémům, další informace naleznete na adrese http://www.adobe.com/go/strict_policy_files_cz.";
"IDS_CONSOLE_POLICY_FILE_CROSS_DOMAIN"		= "Ignorován soubor zásad požadovaný z %s, protože došlo k přesměrování všech domén na %s";
"IDS_CONSOLE_TOP_URL"						= "Byl načten SWF na kořenové úrovni: %s";
"IDS_CONSOLE_META_POLICY_HDR_UNKNOWN"		= "Neznámá meta zásada v hlavičce HTTP z %s: %s";
"IDS_CONSOLE_META_POLICY_HDR_FTP"			= "Hlavička HTTP z %s specifikuje meta zásadu \'by-ftp-filename\', která platí pouze pro FTP, ne pro HTTP.";
"IDS_CONSOLE_META_POLICY_HDR_CONFLICT"		= "Konfliktní meta zásada v hlavičce HTTP z %s: %s";
"IDS_CONSOLE_META_POLICY_HDR_PREV"			= "Meta zásada %s v hlavičce HTTP z %s je v konfliktu s dříve zavedenou meta zásadou %s";
"IDS_CONSOLE_POLICY_FILE_NONE_THIS_RSP"		= "Ignorován soubor zásad v %s z důvodu externě povolených zásad pro všechny domény: none-this-response";
"IDS_CONSOLE_POLICY_FILE_SITE_NONMASTER"	= "Ignorován tag <site-control> v souboru zásad z %s. Tento tag je povolen pouze v hlavních souborech zásad.";
"IDS_CONSOLE_META_POLICY_BAD_BY_TYPE"		= "Ignorován tag <site-control> v souboru zásad z %s. Meta zásada \'by-content-type\' je platná pouze pro servery HTTP.";
"IDS_CONSOLE_META_POLICY_BAD_BY_FTP"		= "Ignorován tag <site-control> v souboru zásad z %s. Meta zásada \'by-ftp-filename\' je platná pouze pro servery FTP.";
"IDS_CONSOLE_META_POLICY_BAD_THIS_RESPONSE"	= "Ignorován tag <site-control> v souboru zásad z %s. Meta zásada \'none-this-response\' je platná pouze pro hlavičku odpovědi HTTP externě povolených zásad pro všechny domény.";
"IDS_CONSOLE_META_POLICY_FILE_UNKNOWN"		= "Neznámá meta zásada v souboru zásad z %s: %s";
"IDS_CONSOLE_META_POLICY_FILE_PREV"			= "Meta zásada %s v souboru zásad z %s je v konfliktu s dříve zavedenou meta zásadou %s";
"IDS_CONSOLE_META_POLICY_DEFAULT"			= "Doména %s nespecifikuje meta zásadu.  Aplikována výchozí meta zásada \'master-only\'.  Tato konfigurace je neschválená.  Informace o vyřešení tohoto problému naleznete na adrese http://www.adobe.com/go/strict_policy_files_cz.";
"IDS_CONSOLE_POLICY_FILE_SOCK_NONE_NO"		= "SWF ze %s se k socketu ve své vlastní doméně nemusí bez souboru zásad připojit.  Informace o vyřešení tohoto problému naleznete na adrese http://www.adobe.com/go/strict_policy_files_cz.";
"IDS_CONSOLE_POLICY_FILE_SOCK_TIMEOUT"		= "Doba platnosti na %s (3 sekundy) při čekání na soubor zásad socketu.  Toto by nemělo být příčinou žádných potíží, ale na adrese http://www.adobe.com/go/strict_policy_files_cz naleznete vysvětlení.";
"IDS_CONSOLE_META_POLICY_IMPLICIT"			= "Doména %s meta zásadu explicitně nespecifikuje, ale typ obsahu souboru zásad %s je \'text/x-cross-domain-policy\'.  Je aplikována meta zásada \'by-content-type\'.";
"IDS_CONSOLE_META_POLICY_REJECT"			= "Soubor zásad v %s je ignorován z důvodu meta zásady \'%s\'.";
"IDS_CONSOLE_POLICY_FILE_TOO_BIG"			= "Ignorován soubor zásad socketu v %s, protože je příliš velký.  Soubory zásad socketu by neměly přesáhnout velikost 20 kB.";
"IDS_CONSOLE_MASTER_SELF_INVALIDATED"		= "Soubor zásad v %s ruší platnost svých vlastních zásad <allow-access-from> deklarací meta zásad \'none\'.";
"IDS_CONSOLE_POLICY_FILE_BAD_PORT_SPEC"		= "Ignorována neplatná specifikace čísla portu \'%s\' v souboru zásad v %s";
"IDS_CONSOLE_POLICY_FILE_BAD_ALLOW"			= "Ignorován neplatný tag <%s> pro doménu \'%s\' v souboru zásad v %s";
"IDS_CONSOLE_REQUEST_ALLOWED_BY_POLICY"		= "Požadavek na zdroj v %s vznesený žadatelem z %s je povolen na základě souboru zásad v %s";
"IDS_CONSOLE_REQUEST_DENIED_NO_POLICY"		= "Požadavek na zdroj v %s vznesený žadatelem z %s je odmítnut z důvodu nepřítomnosti povolení v souboru zásad.";
"IDS_CONSOLE_SOCKET_UNAVAILABLE"			= "Požadavek na zdroj v %s vznesený žadatelem z %s selhal, protože se nepodařilo navázat spojení se serverem.";
"IDS_CONSOLE_NO_ASFUNCTION"					= "Adresa URL %s je odmítnuta, protože protokol \'asfunction:\' lze použít pouze pro cíle vazeb, nikoli pro síťová rozhraní API.";
"IDS_CONSOLE_POLICY_BAD_SECURE_ATTR"		= "Ignorován atribut \'secure\' v souboru zásad z %s. Atribut \'secure\' je povolen pouze v protokolu HTTPS a v souborech zásad socketu.  Podrobné informace naleznete na adrese http://www.adobe.com/go/strict_policy_files_cz.";
"IDS_CONSOLE_POLICY_SOCK_SECURE_ATTR"		= "V souboru zásad z %s byl nalezen stav zabezpečený=\'true\', ale zdá se, že hostitel %s se neodkazuje na lokální počítač.  To může být nebezpečné.  Podrobné informace naleznete na adrese http://www.adobe.com/go/strict_policy_files_cz.";
"IDS_CONSOLE_POLICY_REASON_DATA"			= "Hledá se tag <allow-access-from> v souborech zásad za účelem autorizace načítání dat ze zdroje v %s žadatelem z %s";
"IDS_CONSOLE_POLICY_REASON_HEADERS"			= "Hledá se tag <allow-http-request-headers-from> v souborech zásad za účelem autorizace odeslání hlavičky na adresu URL  %s žadatelem z %s";
"IDS_CONSOLE_QUESTIONABLE_SCRIPTING"		= "-- Skriptovací adresy URL prohlížeče mohou být prováděny pouze pomocí funkcí getURL a navigateToURL.";
"IDS_CONSOLE_WARN_ALLOW_NEVER"				= "Upozornění: V kódu HTML byl nalezen parametr AllowScriptAccess=\'never\'.  Toto nastavení je neúčinné a neschválené.  Podrobné informace naleznete na adrese http://www.adobe.com/go/allowscriptaccess_cz.";
"IDS_CONSOLE_WARN_ALLOW_SAMEDOM"			= "Upozornění: V kódu HTML byl nalezen parametr AllowNetworking=\'%s\' se soubory HTML a SWF ve stejné doméně.  Toto nastavení je neúčinné a neschválené.  Podrobné informace naleznete na adrese http://www.adobe.com/go/allowscriptaccess_cz.";
"IDS_CONSOLE_WARN_3D_SURFACE_TOO_BIG"		= "Upozornění: Objekt 3D DisplayObject nebude vykreslen. Jeho rozměry (%s, %s) jsou pro vykreslení příliš veliké.";
"IDS_CONSOLE_WARN_FILTER_TOO_BIG"			= "Upozornění: Filtr nebude vykreslen. Filtrované rozměry objektu DisplayObject  (%s, %s) jsou pro vykreslení příliš veliké.";
"IDS_CONSOLE_FORCE_DOWNLOAD_WAS_SET"		= "Pokus o načtení %s se nezdařil, protože hodnotou Content-Disposition byla sada attachment.";
"IDS_CONSOLE_USER_ACTION_REQUIRED"			= "Určité akce, jako například ty, které zobrazují rozbalovací okno, mohou být vyvolány pouze na základě akce provedené uživatelem. Například klepnutí myší nebo stisk tlačítka.";
"IDS_LOCALCONNECTION_USERSCOPED_LOCKED"     = "Hodnotu LocalConnection.isPerUser nelze změnit, protože již byla uzamknuta voláním příkazu LocalConnection.connect, .send nebo .close.";
"IDS_CONSOLE_POLICY_FILE_BAD_PF_URL"		= "Ignorován soubor zásad z důvodu neplatné adresy URL se znaky, které nejsou v ASCII %s";
"IDS_CONSOLE_POLICY_FILE_BAD_DATA_URL"		= "Operaci nelze autorizovat z důvodu neplatné adresy URL se znaky, které nejsou v ASCII %s";
